HalloYang06/PSOC_E84_robot/applications/main.c
            rt_kprintf("[m55_mic] configured mic0 sr=%d ch=%d bits=%d\n",
                       M55_AUDIO_SAMPLE_RATE,
                       M55_AUDIO_CHANNELS,
                       M55_AUDIO_BITS_PER_SAMPLE);
            rt_kprintf("[m55_mic] pdm_gain=%d ret=%ld\n",
                       M55_XIAOZHI_PDM_GAIN,
                       (long)gain_ret);
        }
        else
        {
            rt_kprintf("[m55_mic] configure mic0 failed\n");
        }
    }

    g_m55_mic.running = RT_TRUE;
    g_m55_mic.last_frame_tick = 0U;
    g_m55_mic.thread = rt_thread_create("m55_mic",
                                        m55_mic_thread_entry,
                                        RT_NULL,
                                        M55_MIC_THREAD_STACK,
                                        18,
                                        10);
    if (g_m55_mic.thread == RT_NULL)
    {
        g_m55_mic.running = RT_FALSE;
        rt_kprintf("[m55_mic] create thread failed\n");
        return -RT_ERROR;
    }

    rt_thread_startup(g_m55_mic.thread);
    rt_kprintf("[m55_mic] started\n");
    (void)voice_service_publish_status_now();
    return RT_EOK;
}

static rt_err_t m55_mic_stop_internal(void)
{
    if (!g_m55_mic.running)
    {
        return RT_EOK;
    }

    g_m55_mic.running = RT_FALSE;
    rt_thread_mdelay(50);
    g_m55_mic.thread = RT_NULL;
    rt_kprintf("[m55_mic] stopped\n");
    (void)voice_service_publish_status_now();
    return RT_EOK;
}

static void m55_mic_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_start_internal();
    rt_kprintf("m55_mic_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_test, Start local CM55 mic0 capture test);

static void m55_mic_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_stop_internal();
    rt_kprintf("m55_mic_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_stop, Stop local CM55 mic0 capture test);

static void voice_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_xiaozhi_talk_start_from_ui();
    rt_kprintf("voice_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_test, Start Xiaozhi listening from CM55 mic0);

static void voice_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_xiaozhi_talk_stop_from_ui();
    rt_kprintf("voice_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_stop, Stop Xiaozhi listening from CM55 mic0);

static void wake_on(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_wake_listen_start_for_xiaozhi();
    rt_kprintf("wake_on ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_on, Start wake listening from CM55 mic0);

static void wake_off(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_wake_listen_stop_for_xiaozhi();
    rt_kprintf("wake_off ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_off, Stop wake listening from CM55 mic0);

static void wake_dump_pcm(int argc, char **argv)
{
    const char *path = "/latest_wake.pcm";
    rt_err_t ret;

    if ((argc >= 2) && (argv[1] != RT_NULL) && (argv[1][0] != '\0'))
    {
        path = argv[1];
    }

    ret = voice_service_dump_latest_pcm(path);
    rt_kprintf("wake_dump_pcm ret=%d path=%s\n", ret, path);
}
MSH_CMD_EXPORT(wake_dump_pcm, Save latest CM55 wake PCM to a raw pcm file);

static void xz_url(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_url current=%s\n", xiaozhi_voice_relay_get_url());
        return;
    }

    ret = xiaozhi_voice_relay_set_url(argv[1]);
    rt_kprintf("xz_url ret=%d url=%s\n", ret, xiaozhi_voice_relay_get_url());
}
MSH_CMD_EXPORT(xz_url, Get or set Xiaozhi websocket URL);

static void xz_token(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_token configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
        return;
    }

    ret = xiaozhi_voice_relay_set_token(argv[1]);
    rt_kprintf("xz_token ret=%d configured=%d\n", ret, xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token, Set Xiaozhi platform relay token);

static void xz_token_begin(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_begin();
    rt_kprintf("xz_token_begin ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_token_begin, Begin chunked Xiaozhi platform token update);

static void xz_token_part(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: xz_token_part <token_chunk_48_to_60_chars>\n");
        return;
    }

    ret = xiaozhi_voice_relay_token_update_part(argv[1]);
    rt_kprintf("xz_token_part ret=%d len=%lu\n",
               ret,
               (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(xz_token_part, Append one chunk to Xiaozhi platform token);

static void xz_token_commit(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_commit();
    rt_kprintf("xz_token_commit ret=%d configured=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_commit, Commit chunked Xiaozhi platform token);

static void xz_token_clear(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);

    xiaozhi_voice_relay_token_update_clear();
    rt_kprintf("xz_token_clear configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_clear, Clear Xiaozhi platform token);

static void xz_reconnect(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_reconnect_xiaozhi();
    rt_kprintf("xz_reconnect ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_reconnect, Reconnect Xiaozhi websocket after URL or token change);

static void xz_status(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);

    rt_kprintf("xz_status url=%s\n", xiaozhi_voice_relay_get_url());
    rt_kprintf("xz_status token=%d connected=%d ws_stage=%d ws_errno=%d\n",
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_status, Show Xiaozhi websocket status without printing token);

static void xz_tcp_probe(int argc, char **argv)
{
    const char *ip = M55_XIAOZHI_CLOUD_IP;
    int port = M55_XIAOZHI_CLOUD_PORT;
    int fd;
    int ret;
    int native_errno;
    struct sockaddr_in cloud_addr;

