HalloYang06/PSOC_E84_robot/applications/main.c
    rt_memset(&ack, 0, sizeof(ack));
    ack.type = MSG_TYPE_VOICE_CONTROL_ACK;
    ack.payload.voice_control.cmd = cmd;
    ack.payload.voice_control.arg0 = (rt_uint32_t)ret;
    ack.payload.voice_control.arg1 = (rt_uint32_t)rt_tick_get();
    (void)m33_m55_comm_publish(&ack);
}

static rt_err_t m55_bridge_run_tcp_probe(void)
{
    int fd;
    int ret;
    int opt_error = 0;
    socklen_t opt_len = sizeof(opt_error);
    fd_set writefds;
    struct timeval timeout;
    struct sockaddr_in addr;

    g_tcp_probe_stage = 0;
    g_tcp_probe_errno = 0;
    g_tcp_probe_result = -RT_ERROR;
    g_tcp_probe_so_error = 0;
    g_tcp_probe_select_ret = 0;
    g_tcp_probe_fcntl_ret = 0;
    xiaozhi_bridge_publish_status();

    rt_memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_port = htons(M55_XIAOZHI_CLOUD_PORT);
    addr.sin_addr.s_addr = inet_addr(M55_XIAOZHI_CLOUD_IP);

    errno = 0;
    g_tcp_probe_stage = 10;
    xiaozhi_bridge_publish_status();
    fd = socket(AF_INET, SOCK_STREAM, 0);
    if (fd < 0)
    {
        g_tcp_probe_errno = errno;
        g_tcp_probe_result = -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] socket failed fd=%d errno=%d\n", fd, errno);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 20;
    xiaozhi_bridge_publish_status();
    ret = fcntl(fd, F_SETFL, O_NONBLOCK);
    g_tcp_probe_fcntl_ret = ret;
    if (ret < 0)
    {
        g_tcp_probe_errno = errno;
        g_tcp_probe_result = -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] fcntl nonblock failed fd=%d ret=%d errno=%d\n", fd, ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 30;
    xiaozhi_bridge_publish_status();
    ret = connect(fd, (struct sockaddr *)&addr, sizeof(addr));
    g_tcp_probe_result = ret;
    g_tcp_probe_errno = errno;
    if (ret == 0)
    {
        g_tcp_probe_stage = 60;
        g_tcp_probe_so_error = 0;
        rt_kprintf("[m55_tcp_probe] connect immediate ok %s:%d fd=%d\n",
                   M55_XIAOZHI_CLOUD_IP,
                   M55_XIAOZHI_CLOUD_PORT,
                   fd);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return RT_EOK;
    }

    if ((errno != EINPROGRESS) && (errno != EWOULDBLOCK) && (errno != EALREADY))
    {
        rt_kprintf("[m55_tcp_probe] connect immediate failed ret=%d errno=%d\n", ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    FD_ZERO(&writefds);
    FD_SET(fd, &writefds);
    timeout.tv_sec = 5;
    timeout.tv_usec = 0;

    errno = 0;
    g_tcp_probe_stage = 40;
    xiaozhi_bridge_publish_status();
    ret = select(fd + 1, RT_NULL, &writefds, RT_NULL, &timeout);
    g_tcp_probe_select_ret = ret;
    g_tcp_probe_errno = errno;
    if (ret <= 0)
    {
        g_tcp_probe_result = (ret == 0) ? -RT_ETIMEOUT : -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] select failed ret=%d errno=%d\n", ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return (ret == 0) ? -RT_ETIMEOUT : -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 50;
    xiaozhi_bridge_publish_status();
    ret = getsockopt(fd, SOL_SOCKET, SO_ERROR, &opt_error, &opt_len);
    g_tcp_probe_errno = errno;
    g_tcp_probe_so_error = opt_error;
    if ((ret < 0) || (opt_error != 0))
    {
        g_tcp_probe_result = (ret < 0) ? -RT_ERROR : -opt_error;
        rt_kprintf("[m55_tcp_probe] so_error ret=%d errno=%d so_error=%d\n", ret, errno, opt_error);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    g_tcp_probe_stage = 60;
    g_tcp_probe_result = 0;
    g_tcp_probe_errno = 0;
    rt_kprintf("[m55_tcp_probe] connect ok %s:%d fd=%d select=%d\n",
               M55_XIAOZHI_CLOUD_IP,
               M55_XIAOZHI_CLOUD_PORT,
               fd,
               g_tcp_probe_select_ret);
    closesocket(fd);
    xiaozhi_bridge_publish_status();
    return RT_EOK;
}

static void xiaozhi_bridge_publish_status(void)
{
    m33_m55_message_t status;

    if (voice_service_publish_status_now() == RT_EOK)
    {
        return;
    }

    rt_memset(&status, 0, sizeof(status));
    status.type = MSG_TYPE_VOICE_STATUS;
    status.payload.voice_status.flags =
        (xiaozhi_voice_relay_has_token() ? VOICE_STATUS_FLAG_XIAOZHI_HAS_TOKEN : 0U) |
        (websocket_client_is_connected() ? VOICE_STATUS_FLAG_XIAOZHI_CONNECTED : 0U);
    wifi_config_fill_voice_status(&status.payload.voice_status);
    if (xiaozhi_voice_relay_has_token())
    {
        status.payload.voice_status.flags |= VOICE_STATUS_FLAG_XIAOZHI_HAS_TOKEN;
    }
    if (websocket_client_is_connected())
    {
        status.payload.voice_status.flags |= VOICE_STATUS_FLAG_XIAOZHI_CONNECTED;
    }
    status.payload.voice_status.xiaozhi_ws_stage = websocket_client_last_stage();
    status.payload.voice_status.xiaozhi_ws_errno = websocket_client_last_errno();
    status.payload.voice_status.xiaozhi_token_len = (rt_uint32_t)xiaozhi_voice_relay_token_len();
    status.payload.voice_status.xiaozhi_token_staging_len = (rt_uint32_t)xiaozhi_voice_relay_token_staging_len();
    status.payload.voice_status.net_probe_posix_tcp = (rt_int32_t)g_xz_bridge_loops;
    status.payload.voice_status.net_probe_posix_errno = (rt_int32_t)g_xz_bridge_consumed;
    status.payload.voice_status.net_probe_sal_tcp = g_xz_bridge_last_consume_ret;
    status.payload.voice_status.net_probe_sal_errno = (rt_int32_t)g_xz_bridge_last_msg_type;
    status.payload.voice_status.net_probe_lwip_tcp = (rt_int32_t)g_xz_reconnect_step;
    status.payload.voice_status.net_probe_lwip_errno = g_xz_reconnect_result;
    status.payload.voice_status.cloud_tcp_result = g_tcp_probe_select_ret;
    status.payload.voice_status.cloud_tcp_errno = g_tcp_probe_fcntl_ret;
    (void)m33_m55_comm_publish(&status);
}

rt_uint32_t voice_service_bridge_diag_loops(void)
{
    return g_xz_bridge_loops;
}

rt_uint32_t voice_service_bridge_diag_consumed(void)
{
    return g_xz_bridge_consumed;
}

rt_int32_t voice_service_bridge_diag_last_ret(void)
{
    return g_xz_bridge_last_consume_ret;
}

rt_int32_t voice_service_bridge_diag_phase(void)
{
    return g_xz_bridge_phase;
}

static void xiaozhi_reconnect_thread_entry(void *parameter)
{
    rt_err_t ret;
    rt_bool_t service_ready;

    RT_UNUSED(parameter);

