HalloYang06/PSOC_E84_robot/applications/main.c
    g_xz_reconnect_step = 10U;
    g_xz_reconnect_result = 0;

    ret = voice_service_init("YOUR_BAIDU_API_KEY", "YOUR_BAIDU_SECRET_KEY");
    g_xz_reconnect_result = ret;
    g_xz_reconnect_step = 11U;
    service_ready = ((ret == RT_EOK) || (ret == -RT_EBUSY)) ? RT_TRUE : RT_FALSE;
    if (service_ready)
    {
        g_xiaozhi_voice_started = RT_TRUE;
        g_xz_reconnect_step = 20U;
        g_xz_reconnect_result = RT_EOK;
        if (!websocket_client_is_connected())
        {
            g_xz_reconnect_step = 30U;
            ret = websocket_client_connect();
            g_xz_reconnect_result = ret;
            g_xz_reconnect_step = 31U;
        }
        else
        {
            ret = RT_EOK;
        }
        if (ret == RT_EOK)
        {
            char hello[768];

            g_xz_reconnect_step = 40U;
            ret = xiaozhi_voice_relay_build_hello(hello, sizeof(hello));
            if (ret == RT_EOK)
            {
                ret = websocket_client_send_text(hello);
            }
            g_xz_reconnect_result = ret;
            g_xz_reconnect_step = 41U;
        }
    }

    g_xz_reconnect_thread = RT_NULL;
}

static rt_err_t xiaozhi_bridge_start_reconnect_async(void)
{
    if (g_xz_reconnect_thread != RT_NULL)
    {
        return -RT_EBUSY;
    }

    wifi_status_publish_kick();
    g_xz_reconnect_thread = rt_thread_create("xz_reconn",
                                             xiaozhi_reconnect_thread_entry,
                                             RT_NULL,
                                             12288,
                                             17,
                                             10);
    if (g_xz_reconnect_thread == RT_NULL)
    {
        return -RT_ENOMEM;
    }

    rt_thread_startup(g_xz_reconnect_thread);
    return RT_EOK;
}

static void wifi_status_publish_thread_entry(void *parameter)
{
    RT_UNUSED(parameter);

    for (rt_uint32_t i = 0; i < 45U; i++)
    {
        (void)wifi_config_diag();
        (void)wifi_config_whd_diag();
        xiaozhi_bridge_publish_status();
        rt_thread_mdelay(1000);
    }

    g_wifi_status_thread = RT_NULL;
}

static void wifi_status_publish_kick(void)
{
    if (g_wifi_status_thread != RT_NULL)
    {
        return;
    }

    g_wifi_status_thread = rt_thread_create("wifi_stat",
                                            wifi_status_publish_thread_entry,
                                            RT_NULL,
                                            4096,
                                            19,
                                            10);
    if (g_wifi_status_thread != RT_NULL)
    {
        rt_thread_startup(g_wifi_status_thread);
    }
}

static rt_err_t xiaozhi_bridge_handle_config(const voice_config_msg_t *config)
{
    rt_err_t ret = RT_EOK;

    if (config == RT_NULL)
    {
        return -RT_EINVAL;
    }

    switch ((voice_config_key_t)config->key)
    {
    case VOICE_CONFIG_XIAOZHI_URL:
        ret = xiaozhi_voice_relay_set_url(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN:
        ret = xiaozhi_voice_relay_set_token(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_BEGIN:
        ret = xiaozhi_voice_relay_token_update_begin();
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_PART:
        ret = xiaozhi_voice_relay_token_update_part(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_COMMIT:
        ret = xiaozhi_voice_relay_token_update_commit();
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_CLEAR:
        xiaozhi_voice_relay_token_update_clear();
        ret = RT_EOK;
        break;
    case VOICE_CONFIG_XIAOZHI_RECONNECT:
        ret = xiaozhi_bridge_start_reconnect_async();
        break;
    case VOICE_CONFIG_WIFI_SSID:
        ret = wifi_config_set_ssid(config->value);
        break;
    case VOICE_CONFIG_WIFI_PASSWORD:
        ret = wifi_config_set_password(config->value);
        break;
    case VOICE_CONFIG_WIFI_CONNECT:
        ret = wifi_config_connect();
        wifi_status_publish_kick();
        break;
    case VOICE_CONFIG_WIFI_DISCONNECT:
        ret = wifi_config_disconnect();
        wifi_status_publish_kick();
        break;
    case VOICE_CONFIG_WIFI_SAVE:
        ret = wifi_config_save();
        break;
    case VOICE_CONFIG_WIFI_FORGET:
        ret = wifi_config_forget();
        wifi_status_publish_kick();
        break;
    case VOICE_CONFIG_WIFI_AUTO_CONNECT:
        ret = wifi_config_set_auto_connect((config->value[0] == '0') ? RT_FALSE : RT_TRUE);
        if (ret == RT_EOK)
        {
            ret = wifi_config_save();
        }
        break;
    default:
        ret = -RT_EINVAL;
        break;
    }

    rt_kprintf("[m55_xz_bridge] config key=%lu ret=%d token=%d\n",
               (unsigned long)config->key,
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0);
    return ret;
}

static rt_err_t xiaozhi_bridge_handle_control(const voice_control_msg_t *control)
{
    rt_err_t ret = RT_EOK;

    if (control == RT_NULL)
    {
        return -RT_EINVAL;
    }

    switch ((voice_control_cmd_t)control->cmd)
    {
    case VOICE_CTRL_START_CAPTURE:
        ret = m55_voice_start_for_xiaozhi();
        rt_kprintf("[m55_xz_bridge] start_capture voice_start ret=%d\n", ret);
        if ((ret != RT_EOK) && (ret != -RT_EBUSY))
        {
            voice_service_note_error(-41001);
            break;
        }
        if ((ret == RT_EOK) || (ret == -RT_EBUSY))
        {
            g_xiaozhi_voice_started = RT_TRUE;
            ret = voice_service_start_xiaozhi_talk();
            rt_kprintf("[m55_xz_bridge] start_capture talk_start ret=%d connected=%d stage=%d errno=%d\n",
                       ret,
                       websocket_client_is_connected() ? 1 : 0,
                       websocket_client_last_stage(),
                       websocket_client_last_errno());
            if ((ret != RT_EOK) && (ret != -RT_EBUSY))
            {
                voice_service_note_error(-41002);
                break;
            }
            if ((ret == RT_EOK) || (ret == -RT_EBUSY))
            {
                ret = m55_mic_start_internal();
                rt_kprintf("[m55_xz_bridge] start_capture mic_start ret=%d\n", ret);
                if (ret == -RT_EBUSY)
                {
                    ret = RT_EOK;
                }
                if (ret != RT_EOK)
                {
                    voice_service_note_error(-41003);
                }
            }
        }
        break;
    case VOICE_CTRL_STOP_CAPTURE:
        (void)m55_mic_stop_internal();
        if (voice_service_xiaozhi_is_listening())
        {
            ret = voice_service_abort_xiaozhi_talk_local();
            rt_kprintf("[m55_xz_bridge] stop_capture local_abort ret=%d connected=%d stage=%d errno=%d\n",
                       ret,
                       websocket_client_is_connected() ? 1 : 0,
                       websocket_client_last_stage(),
                       websocket_client_last_errno());
        }
        else
        {
            ret = RT_EOK;
            rt_kprintf("[m55_xz_bridge] stop_capture already idle connected=%d stage=%d errno=%d\n",
                       websocket_client_is_connected() ? 1 : 0,
                       websocket_client_last_stage(),
                       websocket_client_last_errno());
        }
        break;
    case VOICE_CTRL_START_LISTEN:
        ret = m55_wake_listen_start_for_xiaozhi();
        if (ret == RT_EOK)
        {
            g_xiaozhi_voice_started = RT_TRUE;
        }
        break;
    case VOICE_CTRL_STOP_LISTEN:
        ret = m55_wake_listen_stop_for_xiaozhi();
        break;
    case VOICE_CTRL_NET_PROBE:
        ret = m55_bridge_run_tcp_probe();
        break;
    case VOICE_CTRL_WIFI_DIAG:
        ret = wifi_config_diag();
        break;
    case VOICE_CTRL_WIFI_SCAN:
        ret = wifi_config_scan();
        wifi_status_publish_kick();
        break;
    case VOICE_CTRL_WHD_DIAG:
        ret = wifi_config_whd_diag();
        break;
    case VOICE_CTRL_M33_PCM_PROBE_ENABLE:
    case VOICE_CTRL_M33_PCM_PROBE_DISABLE:
    {
        m33_m55_message_t local_msg;

        rt_memset(&local_msg, 0, sizeof(local_msg));
        local_msg.type = MSG_TYPE_VOICE_CONTROL;
        local_msg.payload.voice_control = *control;
        voice_service_handle_ipc_message(&local_msg);
        ret = RT_EOK;
        break;
    }
    default:
        ret = -RT_EINVAL;
        break;
    }

    rt_kprintf("[m55_xz_bridge] control cmd=%lu ret=%d\n",
               (unsigned long)control->cmd,
               ret);
    return ret;
}

