HalloYang06/PSOC_E84_robot/applications/main.c
static void xiaozhi_bridge_thread_entry(void *parameter)
{
    m33_m55_message_t msg;

    RT_UNUSED(parameter);

    (void)m33_m55_comm_init();
    (void)xiaozhi_voice_relay_init();
    rt_kprintf("[m55_xz_bridge] ready token=%d url=%s\n",
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               xiaozhi_voice_relay_get_url());

    while (1)
    {
        rt_err_t consume_ret;

        g_xz_bridge_loops++;
        if ((g_xz_bridge_loops % 500U) == 0U)
        {
            rt_kprintf("[m55_xz_bridge] hb loops=%lu consumed=%lu ret=%ld type=%lu phase=%ld\n",
                       (unsigned long)g_xz_bridge_loops,
                       (unsigned long)g_xz_bridge_consumed,
                       (long)g_xz_bridge_last_consume_ret,
                       (unsigned long)g_xz_bridge_last_msg_type,
                       (long)g_xz_bridge_phase);
        }
        g_xz_bridge_phase = 1;
        while ((consume_ret = m33_m55_comm_consume(&msg)) == RT_EOK)
        {
            rt_err_t ret = -RT_EINVAL;

            g_xz_bridge_phase = 2;
            g_xz_bridge_consumed++;
            g_xz_bridge_last_msg_type = msg.type;
            if ((g_xz_bridge_consumed % 100U) == 0U)
            {
                rt_kprintf("[m55_xz_bridge] consumed=%lu type=%lu\n",
                           (unsigned long)g_xz_bridge_consumed,
                           (unsigned long)msg.type);
            }
            if (msg.type == MSG_TYPE_VOICE_CONFIG)
            {
                g_xz_bridge_phase = 10;
                ret = xiaozhi_bridge_handle_config(&msg.payload.voice_config);
                g_xz_bridge_phase = 11;
                xiaozhi_bridge_publish_ack(1000U + msg.payload.voice_config.key, ret);
                xiaozhi_bridge_publish_status();
            }
            else if (msg.type == MSG_TYPE_VOICE_CONTROL)
            {
                g_xz_bridge_phase = 20;
                ret = xiaozhi_bridge_handle_control(&msg.payload.voice_control);
                g_xz_bridge_phase = 21;
                xiaozhi_bridge_publish_ack(msg.payload.voice_control.cmd, ret);
                xiaozhi_bridge_publish_status();
            }
            else
            {
                g_xz_bridge_phase = 30 + (rt_int32_t)msg.type;
                voice_service_handle_ipc_message(&msg);
            }
        }
        g_xz_bridge_last_consume_ret = consume_ret;
        g_xz_bridge_phase = 3;
        rt_thread_mdelay(50);
    }
}

static void xiaozhi_bridge_thread_start(void)
{
    if (g_xiaozhi_bridge_thread != RT_NULL)
    {
        return;
    }

    g_xiaozhi_bridge_thread = rt_thread_create("xz_bridge",
                                               xiaozhi_bridge_thread_entry,
                                               RT_NULL,
                                               32768,
                                               17,
                                               10);
    if (g_xiaozhi_bridge_thread != RT_NULL)
    {
        rt_thread_startup(g_xiaozhi_bridge_thread);
    }
    else
    {
        rt_kprintf("[m55_xz_bridge] create thread failed\n");
    }
}

static void m55_wifi_ssid(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_ssid <ssid>\n");
        return;
    }

    ret = wifi_config_set_ssid(argv[1]);
    rt_kprintf("m55_wifi_ssid ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_ssid, Set CM55 WiFi SSID in RAM);

static void m55_wifi_password(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_password <password>\n");
        return;
    }

    ret = wifi_config_set_password(argv[1]);
    rt_kprintf("m55_wifi_password ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_password, Set CM55 WiFi password in RAM);

static void m55_wifi_connect(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_connect ret=%d\n", wifi_config_connect());
}
MSH_CMD_EXPORT(m55_wifi_connect, Connect CM55 WiFi using staged SSID/password);

static void m55_wifi_save(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_save, Save CM55 WiFi SSID/password to local flash);

static void m55_wifi_forget(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_forget ret=%d\n", wifi_config_forget());
}
MSH_CMD_EXPORT(m55_wifi_forget, Remove saved CM55 WiFi credentials);

static void m55_wifi_auto(int argc, char **argv)
{
    rt_bool_t enable;

    if (argc < 2)
    {
        wifi_config_snapshot_t snapshot;
        wifi_config_get_snapshot(&snapshot);
        rt_kprintf("usage: m55_wifi_auto <0|1>, current=%lu\n",
                   (unsigned long)snapshot.auto_connect);
        return;
    }

    enable = (argv[1][0] != '0') ? RT_TRUE : RT_FALSE;
    rt_kprintf("m55_wifi_auto ret=%d\n", wifi_config_set_auto_connect(enable));
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_auto, Enable or disable saved WiFi auto-connect);

static void m55_wifi_status(int argc, char **argv)
{
    wifi_config_snapshot_t snapshot;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    wifi_config_get_snapshot(&snapshot);
    rt_kprintf("[wifi_config] ssid=%s saved=%lu auto=%lu storage=%ld connected=%lu ready=%lu rssi=%ld netdev=%s flags=0x%lx last=%ld whd=%ld/%ld\n",
               snapshot.ssid[0] ? snapshot.ssid : "(empty)",
               (unsigned long)snapshot.saved,
               (unsigned long)snapshot.auto_connect,
               (long)snapshot.storage_result,
               (unsigned long)snapshot.wlan_connected,
               (unsigned long)snapshot.wlan_ready,
               (long)snapshot.wlan_rssi,
               snapshot.netdev_name[0] ? snapshot.netdev_name : "(none)",
               (unsigned long)snapshot.netdev_flags,
               (long)snapshot.last_result,
               (long)snapshot.whd_stage,
               (long)snapshot.whd_result);
}
MSH_CMD_EXPORT(m55_wifi_status, Print saved CM55 WiFi config and live status);

static void m55_wifi_print_aps(void)
{
    rt_int32_t i;
    rt_int32_t count = wifi_config_get_scan_count();

