HalloYang06/PSOC_E84_robot/applications/main.c
    rt_kprintf("[wifi_config] cached_ap_count=%ld\n", (long)count);
    if (count <= 0)
    {
        rt_kprintf("[wifi_config] no cached APs; run m55_wifi_scan and wait a few seconds\n");
        return;
    }

    for (i = 0; (i < count) && (i < WIFI_CONFIG_SCAN_MAX_APS); i++)
    {
        wifi_config_ap_t ap;

        if (wifi_config_get_scan_ap(i, &ap) != RT_EOK)
        {
            continue;
        }

        rt_kprintf("[wifi_config] ap[%ld] ssid=\"%s\" rssi=%ld security=%s channel=%ld bssid=%02x:%02x:%02x:%02x:%02x:%02x\n",
                   (long)i,
                   ap.ssid[0] ? ap.ssid : "(hidden)",
                   (long)ap.rssi,
                   wifi_config_security_name(ap.security),
                   (long)ap.channel,
                   ap.bssid[0],
                   ap.bssid[1],
                   ap.bssid[2],
                   ap.bssid[3],
                   ap.bssid[4],
                   ap.bssid[5]);
    }
}

static void m55_wifi_aps(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    m55_wifi_print_aps();
}
MSH_CMD_EXPORT(m55_wifi_aps, Print cached CM55 WiFi scan results);

static void m55_wifi_disconnect(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_disconnect ret=%d\n", wifi_config_disconnect());
}
MSH_CMD_EXPORT(m55_wifi_disconnect, Disconnect CM55 WiFi);

static void m55_wifi_diag(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    (void)wifi_config_diag();
    (void)wifi_config_whd_diag();
}
MSH_CMD_EXPORT(m55_wifi_diag, Print CM55 WiFi and WHD diagnostics);

static void m55_wifi_scan(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_scan ret=%d\n", wifi_config_scan());
    rt_kprintf("wait 3-5 seconds, then run m55_wifi_aps or refresh LVGL with Diag\n");
    m55_wifi_print_aps();
}
MSH_CMD_EXPORT(m55_wifi_scan, Start CM55 WiFi scan);

static void voice_boot_thread_entry(void *parameter)
{
    rt_err_t ret;
    const char *api_key = "YOUR_BAIDU_API_KEY";
    const char *secret_key = "YOUR_BAIDU_SECRET_KEY";

    RT_UNUSED(parameter);

    rt_thread_mdelay(M55_VOICE_BOOT_DELAY_MS);
    rt_kprintf("[m55] starting voice service\n");

    ret = voice_service_init(api_key, secret_key);
    if (ret != RT_EOK)
    {
        rt_kprintf("Voice service init failed: %d\n", ret);
        g_voice_boot_thread = RT_NULL;
        return;
    }

    rt_kprintf("[m55] voice service initialized\n");
    xiaozhi_bridge_thread_start();
    ret = voice_service_start();
    if (ret != RT_EOK)
    {
        rt_kprintf("Voice service start failed: %d\n", ret);
    }
    else
    {
        ret = m55_mic_start_internal();
        rt_kprintf("[m55] local mic autostart ret=%d\n", ret);
    }

    g_voice_boot_thread = RT_NULL;
}

static void boot_self_test_thread_entry(void *parameter)
{
    int i;

    RT_UNUSED(parameter);

    for (i = 0; i < M55_BOOT_SELF_TEST_RETRY_COUNT; i++)
    {
        rt_err_t ret = model_result_publish_boot_self_test();
        rt_kprintf("[m55] boot self-test publish ret=%d try=%d\n", ret, i + 1);
        rt_thread_mdelay(1000);
    }

    g_boot_self_test_thread = RT_NULL;
}

int main(void)
{
    rt_err_t ret;
#if M55_WIFI_SCAN_QA_ONLY
    rt_thread_t wifi_qa_thread;
#endif

    rt_kprintf("Hello RT-Thread\r\n");
    rt_kprintf("This core is cortex-m55\n");

    rt_pin_mode(LED_PIN_G, PIN_MODE_OUTPUT);

#if M55_WIFI_SCAN_QA_ONLY
    rt_kprintf("[m55] WiFi scan QA-only mode; LVGL/voice/OpenClaw/HTTP/autoconnect disabled\n");
    wifi_qa_thread = rt_thread_create("wifi_qa",
                                      m55_wifi_scan_qa_thread_entry,
                                      RT_NULL,
                                      4096,
                                      28,
                                      10);
    if (wifi_qa_thread)
    {
        rt_thread_startup(wifi_qa_thread);
    }

    while (1)
    {
        rt_pin_write(LED_PIN_G, PIN_LOW);
        rt_thread_mdelay(200);
        rt_pin_write(LED_PIN_G, PIN_HIGH);
        rt_thread_mdelay(800);
    }
#else
    (void)wifi_config_service_init();

#ifdef BSP_USING_LVGL
    rt_kprintf("[m55] starting LVGL thread\n");
    ret = lvgl_thread_init();
    rt_kprintf("[m55] LVGL thread init ret=%d\n", ret);
#endif
    wifi_status_publish_kick();

#if !M55_WIFI_LVGL_ONLY
#if M55_WIFI_AUTO_CONNECT_ON_BOOT
    (void)wifi_config_start_auto_connect(3500U);
    wifi_status_publish_kick();
#else
    rt_kprintf("[m55] WiFi auto-connect on boot disabled for XiaoZhi QA; use LVGL connect or m55qa_wifi_connect\n");
#endif

    g_boot_self_test_thread = rt_thread_create("m55_self",
                                               boot_self_test_thread_entry,
                                               RT_NULL,
                                               2048,
                                               15,
                                               10);
    if (g_boot_self_test_thread)
    {
        rt_thread_startup(g_boot_self_test_thread);
    }

    ret = openclaw_integration_init();
    if (ret != RT_EOK)
    {
        rt_kprintf("OpenClaw integration init failed: %d\n", ret);
    }

#if M55_ENABLE_LOCAL_HTTP_SERVER
    ret = http_server_init();
    if (ret != RT_EOK)
    {
        rt_kprintf("HTTP server init failed: %d\n", ret);
    }
#else
    rt_kprintf("M55 local HTTP server disabled; XiaoZhi voice relay uses outbound WebSocket\n");
#endif

    g_voice_boot_thread = rt_thread_create("voice_bt",
                                           voice_boot_thread_entry,
                                           RT_NULL,
                                           4096,
                                           16,
                                           10);
    if (g_voice_boot_thread)
    {
        rt_thread_startup(g_voice_boot_thread);
    }
#else
    rt_kprintf("[m55] WiFi+LVGL-only mode; voice/OpenClaw/HTTP/autoconnect disabled\n");
#if M55_WIFI_AUTO_CONNECT_ON_BOOT
    (void)wifi_config_start_auto_connect(3500U);
    wifi_status_publish_kick();
#else
    rt_kprintf("[m55] WiFi auto-connect on boot disabled for XiaoZhi QA; use LVGL connect or m55qa_wifi_connect\n");
#endif
    g_voice_boot_thread = rt_thread_create("voice_bt",
                                           voice_boot_thread_entry,
                                           RT_NULL,
                                           4096,
                                           16,
                                           10);
    if (g_voice_boot_thread)
    {
        rt_thread_startup(g_voice_boot_thread);
    }
#if M55_XIAOZHI_AUTO_ENABLE
    g_xiaozhi_auto_thread = rt_thread_create("xz_auto",
                                             xiaozhi_auto_connect_thread_entry,
                                             RT_NULL,
                                             6144,
                                             17,
                                             10);
    if (g_xiaozhi_auto_thread)
    {
        rt_thread_startup(g_xiaozhi_auto_thread);
    }
#endif
#endif

    while (1)
    {
        rt_pin_write(LED_PIN_G, PIN_LOW);
        rt_thread_mdelay(500);
        rt_pin_write(LED_PIN_G, PIN_HIGH);
        rt_thread_mdelay(500);
    }

    return 0;
#endif
}
